Revit 2024 API
BuiltInFailures.DetailFailures Class
 Failures about Detail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DetailFailures
Visual Basic
Public NotInheritable Class DetailFailures
Visual C++
public ref class DetailFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DetailFailures
See Also
BuiltInFailures.DetailFailures Members
Autodesk.Revit.DB Namespace